sparvu/data-recorders/man/darwin/man1/diskrec.1
.\" Kronometrix Data Recording Manual Pages
.\" See man kronometrix for the short list of Kronometrix
.Dd June 23, 2019     \" DATE
.Dt DISKREC 1          \" Program name and manual section number
.Os FreeBSD
.Sh NAME                 \" Section Header - required - don't modify
.Nm diskrec
.\" Use .Nm macro to designate other names for the documented program.
.Nd computer system disk data recorder
.Sh SYNOPSIS        \" Section Header - required - don't modify
.Nm
.Op Fl lhV          \" [-lhV]
.Ar | [interval     \" Underlined argument - use .Ar anywhere to underline
[count]]            \" Arguments
.Sh DESCRIPTION     \" Section Header - required - don't modify
Reports per disk performance metrics including: throughput: IOPS, read and write
requests, read and write KBytes, queue length, capacity information and errors.
.Pp
.Nm
can run as a command line interface utility, interactive or continuous mode. In
interactive mode data is displayed to screen, which is useful for troubleshooting
and debug cases. For capacity planning or long-term trend analysis, continuous
mode is used, data being saved to disk, as
.Ar CSV (comma-separated values)
.Pp                      \" Inserts a space
The following options are available:
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl h                 \"-a flag as a list item
help information
.It Fl l
logging mode
.It Fl V
revision information
.It interval sampling interval, in seconds
.It count
number of samples
.El                      \" Ends the list
.Sh PARAMETERS          \" Section Header - required - don't modify
.Nm
saves all recorded data as
.Ar CSV (comma-separated values),
all fields separated by the character ':'
.Bl -tag -width -indent  \" Begins a tagged list
.It time
UNIX time. If interval is less than a second the time will be expressed in
milliseconds since Epoch. (Time)
.It diskid
the storage ID (Disk ID, LUN). (Number)
.It reads
read requests per second. (Number)
.It rkbytes
read KB per seconds. (Number)
.It writes
write requests per second. (Number)
.It wkbytes
write KB per seconds. (Number)
.It queue
the number of not yet completed transactions. (Number)
.It service
service time per transaction in miliseconds. (Number)
.It diskutil
the percentage of time the device had one or more outstanding transactions (Number)
.It iops
disk reads+write requests per second. (Number)
.It rwkbytes
read+write KB per second. (Number)
.It size
volume size in GB. (Number)
.It free
volume free in GB. (Number)
.It usedpct
volume free percentage. (Number)
.El
.Sh EXAMPLES
.Bl -tag -width -compact
.It Pa diskrec 5
print per-disk performance data, every 5 seconds
.It  Pa diskrec 5 10
print 10 times, every 5 seconds interactively to screen
.It  Pa diskrec -l 60
print continuously, every 60 seconds to raw datafile
.El                      \" Ends the list
.Sh DIAGNOSTICS       \" May not be needed
.Bl -diag
.It Sampling interval
This recorder supports sub second interval values. Running the recorder with
values lower than second for long periods of time will add an overhead in terms
of cpu utilization. The lower the interval value the higher the cpu utilization.
We do not recommend using values lower than 60 seconds (60s) for capacity
planning, performance analysis or other type of long historical data analysis.
.El
.Sh SEE ALSO
.Xr cpurec 1 ,
.Xr hdwrec 1 ,
.Xr kronometrix 1 ,
.Xr nicrec 1 ,
.Xr sysrec 1
.\" .Sh STANDARDS       \" Standards relating to command being described
.\" .Sh HISTORY         \" Document history if command behaves uniquely
.Sh AUTHORS
.An Stefan Parvu, sparvu@kronometrix.org
.\" .Sh BUGS            \" Document known, unremedied bugs