sparvu/data-recorders/man/freebsd/man1/sysrec.1
.TH sysrec 1  "$Date: 2014-04-27 #$" "USER COMMANDS"
.SH NAME
sysrec \- System Recorder. Uses perl
.SH SYNOPSIS
.B sysrec
[-hV] | [interval [count]]

.SH DESCRIPTION
sysrec records the following system performance parameters: cpu, memory
utilization, disk and network throughput, errors and system load averages. 
The recorder reports several key metrics across all devices, being the 
main recorder of KDR, responsible for overall system performance. 
This will be the first place to check how your system(s) are performing.

.PP
The raw data is already prepared and formatted for analysis process. 
The recorder runs continuously.


.SH OS
FreeBSD 10

.SH OPTIONS
.SS
\-h
print help information

.SS
\-V
print revision information

.SS
interval
interval in seconds between each sample

.SS
count
number of samples

.PP
.SH EXAMPLES

.SS sysrec 5
executes every 5 seconds 

.SS sysrec 5 10
executes 10 times sampled every 5 seconds

.PP
.SH FIELDS
sysrec krd format is a CSV type of format, where all fields are 
\: separated.

.TP
#1 timestamp
the time in seconds since Epoch. If interval is less than a second 
the time will be expressed in milliseconds since Epoch.

.TP
#2 cpupct
cpu utilization, percentage, across all cpus, number

.TP
#03 sumpct
sum of all cpus utilization, percentage, number

.TP
#04 headpct
headroom cpu available, all cpus, number

.TP
#05 userpct
cpu utilization, user space in percent, number

.TP
#06 nicepct
cpu utilization, user space with nice priority, number

.TP
#07 syspct
cpu utilization, system space, number

.TP
#08 irqpct
cpu percentage servicing interrupts, number

.TP
#09 idlepct
cpu utilization, idle state, number

.TP
#10 runqsz
run queue length, tasks waiting for run time, number

.TP
#11 blocked
processes blocked for resources, number

.TP
#12 pagewait
processes blocked for paging, number

.TP
#13 diskwait
processes blocked for disk io, number

.TP
#14 sleeping
processes sleeping, number 

.TP
#15 memusedpct
size of used memory in percent, number

.TP
#16 memused
size of used memory in kilobytes, number

.TP
#17 memavailpct
size of available memory in kilobytes, number

.TP
#18 memavail
size of available memory in kilobytes, number

.TP
#19 memtotal
size of memory in kilobytes, number

.TP
#20 active
size of active memory pages in kilobytes, number

.TP
#21 inactive
size of inactive memory pages in kilobytes, number

.TP
#22 wired
size of wired memory pages in kilobytes, number
 
.TP
#23 cache
size of memory pages on cache queue in kilobytes, number

.TP
#24 free
size of free memory pages in kilobytes, number

.TP
#25 realfree
size of real free memory in kilobytes, number (inactive + cache + free)

.TP
#26 realfreepct
size of real free memory in percent of total memory, number

.TP
#27 swapin
swap pager pageins, rate

.TP
#28 swappgsin
swap pager pages paged in, rate

.TP
#29 swapout
swap pager pageouts, rate

.TP
#30 swappgsout
swap pager pages paged out, rate

.TP
#31 reads
read requests per second, rate

.TP
#32 rkbytes
read KB per second, rate

.TP
#33 writes
write requests per second, rate

.TP
#34 wkbytes
write KB per second, rate

.TP
#35 queue
the number of not yet completed transactions, rate

.TP
#36 service
service time per transaction in miliseconds, number

.TP
#37 diskutil
the percentage of time the device had one or more transactions 
outstanding, number

.TP
#38 iops
disk read+write requests per second, rate

.TP
#39 rwkbytes
read+write KB per second, rate

.TP
#40 rxpkt
rx packets per second, rate

.TP
#41 rxkbytes
rx KB per second, rate

.TP
#42 rxerr
rx packets containing errors, rate

.TP
#43 rxdrop
rx drop packets per second, rate

.TP
#44 txpkt
tx packets per second, rate

.TP
#45 txkbytes
tx KB per second, rate

.TP
#46 txerr
tx packets containing errors, rate

.TP
#47 cols
number of collisions, rate

.TP
#48 drops
number of dropped packets per seconds, rate

.TP
#49 rxtxpkt
rx+tx packets per second, rate

.TP
#50 rxtxkbytes
rx+tx KB per second, rate

.TP
#51 avg1
LA of the last minute, number

.TP
#52 avg5
LA of the last 5 minutes, number

.TP
#53 avg15
LA of the last 15 minutes, number

.PP
.SH NOTES
This recorder supports interval values lower than second ! 
Running the recorder with values lower than second for long
periods of time will add an overhead in terms of cpu utilization.
The lower the interval value the higher the cpu utilization. We do
not recommend using values lower than 60 seconds (60s) for capacity 
planning, performance analysis or other type of long historical data 
recordings !

.PP
.SH DOCUMENTATION
See Kronometrix Handbook for more details.

.SH EXIT
sysrec will run continuously until is stopped by the master script 
or manually stopped.
 
.SH AUTHOR
Stefan Parvu
.SH SEE ALSO
perl(1)
