sparvu/data-recorders/man/sunos/man1/netrec.1
.TH netrec 1  "$Date:: 2012-05-23 #$" "USER COMMANDS"
.SH NAME
netrec \- Network Protocol Recorder. Uses perl, netstat
.SH SYNOPSIS
.B netrec
[-nshv] 
[interval [count]]
.SH DESCRIPTION
netrec is responsible for collecting network protocol statistics.
A protocol network recorder gathering data from TCP, UDP or
IP of your network stack. For Solaris systems the recorder 
operates on the global or local zones. netrec raw data is 
already prepared and formatted for SDR analysis process. 
The current recorder uses
.I
netstat
utility to extract its metrics. The recorder runs continuously.

.SH OS
Solaris 10+
.SH OPTIONS

.TP
\-n
no zones deployed

.TP
\-s
report statistics for a single shared TCP/IP stack on a system 
running local zones

.TP
\-h
print help information

.TP
\-v
print revision information

.TP
interval
interval in seconds between each sample

.TP
count
number of samples

.PP
.SH EXAMPLES
.TP
Example 1: run on global zone, shared TCP stack
.B # netrec -s

.TP
Example 2: run on localzone, every 5 seconds
.B $ netrec 5

.TP
Example 3: run on localhost every 5 seconds, only 2 times
.B $ netrec 5 2

.PP
.SH FIELDS

.TP
#01 timestamp
seconds since Epoch

.TP
#02 zonename
Solaris zone name

.TP
#03 udpInDatagrams
No. of UDP input datagrams

.TP
#04 udpInErr
No. of UDP input errors

.TP
#05 udpOutDatagrams
No. of UDP output datagrams

.TP
#06 udpOutErrors
No. of UDP output errors

.TP
#07 tcpActiveOpens
No. of outgoing connections since boot, counter

.TP
#08 tcpPassiveOpens
No. of incoming connections since boot, counter

.TP
#09 tcpAttemptFails
No. of outgoing failures since boot, counter

.TP
#10 tcpEstabResets
No. of resets to terminate established connections

.TP
#11 tcpCurrEstab
No. of current established connections

.TP
#12 tcpOutSegs
Total no. of segments sent, counter

.TP
#13 tcpOutDataSegs
Sender total no. of data segments sent, counter

.TP
#14 tcpOutDataBytes
Sender total no. of bytes in data segments sent, counter

.TP
#15 tcpRetransSegs
Total no. of segments retransmitted

.TP
#16 tcpRetransBytes
Sender total no. of bytes in segments retransmitted, counter

.TP
#17 tcpOutRsts
No. of segments sent with RST flag, counter

.TP
#18 tcpListenDrop
Total no. of connections refused, backlog full

.TP
#19 tcpListenDropQ0
Total no. of connections refused, half-open queue full

.TP
#20 tcpHalfOpenDrop
Total no. of connections dropped, full half-open queue

.TP
#21 tcpOutSackRetrs
Total no. of retransmitted segments by SACK retrans

.TP
#22 ipInHdrErr
No. of dg discards for iph error

.TP
#23 ipInAddrErr
No. of dg discards for bad addr

.TP
#24 ipInCksumErr
No. of bad IP header checksum

.TP
#25 tcpInErr
Total no. of segments recv with error, counter

.TP
#26 udpInCksumErr
No. of UDP packets with bad UDP checksum, counter


.PP
.SH DOCUMENTATION
See SDR documentation for more details.
.SH EXIT
netrec will run forever until is stopped by the SMF or
manually stopped using svcadm. Remember netrec in Solaris
operates via SMF so if you dont shutdown properly the SMF
service the SMF will automatically restart the recorder !

.SH AUTHOR
Stefan Parvu
.SH SEE ALSO
netstat(1M)
