sparvu/data-recorders/man/sunos/man1/sysrec.1
.TH sysrec 1  "$Date: 2012-05-23 #$" "USER COMMANDS"
.SH NAME
sysrec \- System Recorder. Uses perl
.SH SYNOPSIS
.B sysrec
[-hv]
[interval [count]]
.SH DESCRIPTION
sysrec is responsible for collecting system utilisation
and specific additional metrics from kernel regarding 
CPU, Mem, Disk and Network. sysrec is a simple utility,
part of K9Toolkit, author Brendan Gregg, updated for SDR.
This is the main recorder used to get an overview of the 
entire system health. sysrec extracts all its information 
from KSTAT interface without using any additional operating 
system commands. Sysrec raw data is already prepared and 
formatted for SDR analysis process. 
The recorder runs continuously.

.SH OS
Solaris 10+
.SH OPTIONS
.TP
\-h
print help information
.TP
\-v
print revision information
.TP
interval
interval in seconds between each sample
.TP
count
number of samples

.PP
.SH EXAMPLES
.TP
Example 1: executes every 5 seconds 
.B $ sysrec 5

.TP
Example 2: executes 10 times sampled every 5 seconds
.B $ sysrec 5 10

.PP
.SH FIELDS
sysrec outputs utilisation and specific metrics 
character \: separated.
The format is selected to match easy SDR Reporting side and 
RRD module for storage and further analysis.

.TP
#01 timestamp
seconds since Epoch

.TP
#02 cpupct
CPU Utilization, across all CPUs, percentage, gauge

.TP
#03 sumpct
sum of all CPUs utilization, percentage, gauge

.TP
#04 headpct
headroom CPU available, all CPUs, percentage, gauge

.TP
#05 userpct
CPU Utilization User space, all cpus, percentage, gauge

.TP
#06 syspct
CPU Utilization System space, all cpus, percentage, gauge

.TP
#07 idlepct
CPU Utilization Idle state, all cpus, percentage, gauge

.TP
#08 runqlen
threads on the run queue, gauge

.TP
#09 pcount
current process count on the system

.TP
#10 tcount
current lwp count on the system

.TP
#11 memusedpct
size of used memory in percent, gauge

.TP
#12 pscanner
scan rate of the page scanner, gauge

.TP
#13 diskpct
sum read+write across disks, percentage, gauge

.TP
#14 diskerrs
operations on the wait queue, gauge

.TP
#15 netpct
throughput, read+write bytes across NICs, percentage, gauge

.TP
#16 neterrs
number of errors due to buffer saturation

.TP
#17 la_1
Load Average 1min

.TP
#18 la_5
Load Average 5min

.TP
#19 la_15
Load Average 15min

.PP
The utilisation values for CPU and Memory have maximum 
values of 100% when Disk and Network don't. 100% CPU 
means all CPUs are running at 100%, however 100% Disk 
means perhaps 1 disk is running at 100%, or 2 disks at 50%;
a similar calculation is used for Network. Future versions 
will fix the 100% utilisation issue.

.PP
.SH DOCUMENTATION
See SDR documentation for more details.
.SH EXIT
sysrec will run forever until is stopped by the SMF or
manually stopped using svcadm. Remember sysrec in Solaris
operates via SMF so if you dont shutdown properly the SMF 
service the SMF will automatically restart the recorder !
 
.SH AUTHOR
Brendan Gregg, Stefan Parvu
.SH SEE ALSO
perl(1)
